In [12]:
import numpy as np
import pandas as pd

In [13]:
df = pd.read_csv("../csv-archivos/HR RAW DATA.csv")

In [298]:
df

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [299]:
df["employeenumber"].dtype

dtype('O')

In [300]:
fila, columna = df[df == 'thirty-two'].stack().index[0]
print(fila)
print(columna)

1293
Age

In [301]:
#Columna Age

In [302]:
df.iloc[31,1] = 47

In [303]:
df.iloc[79,1] = 58

In [304]:
df.iloc[216,1] = 36

In [305]:
df.iloc[357,1] = 55

In [306]:
df.iloc[411,1] = 52

In [307]:
df.iloc[426,1] = 31

In [308]:
df.iloc[593,1] = 30

In [309]:
df.iloc[1198,1] = 26

In [310]:
df.iloc[1226,1] = 37

In [311]:
df.iloc[1293,1] = 32

In [312]:
df.iloc[1325,1] = 24

In [313]:
df.iloc[1584,1] = 32

In [314]:
df['Age'] = df['Age'].astype(int)

In [315]:
#Attrition

In [316]:
df['Attrition'] = df['Attrition'].replace('No', 'False'). replace('Yes', 'True')

In [317]:
df['Attrition'] = df['Attrition'].astype(bool)

In [318]:
#Business Travel

In [319]:
df['BusinessTravel'] = df['BusinessTravel'].replace("non-travel", "no").replace("travel_rarely", "rarely").replace("travel_frequently", "frequently")

In [320]:
#Daily Rate

In [321]:
df["DailyRate"] = df["DailyRate"].str.replace("$","").str.replace(",",".")

In [322]:
df["DailyRate"] = df["DailyRate"].astype(float)

In [323]:
#Department

In [324]:
df["Department"] = df["Department"].str.strip()

In [325]:
#Distance From Home

In [326]:
df["DistanceFromHome"] = abs(df["DistanceFromHome"])

In [327]:
#Education Field

In [328]:
df["EducationField"] = df["EducationField"].str.lower()

In [329]:
#employeecount

In [330]:
df = df.drop('employeecount', axis=1)

In [331]:
#employeenumber

In [332]:
df["employeenumber"] = df["employeenumber"].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [333]:
#NO CONSIGO PASAR A INT LO HE PROBADO TUTOOOO

## ISA

In [334]:
df['MonthlyIncome'] = df['MonthlyIncome'].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [335]:
df['JobRole'] = df['JobRole'].str.lower().str.strip()

In [336]:
df['MaritalStatus'] = df['MaritalStatus'].str.lower().str.strip()

In [337]:
df['MaritalStatus'] = df['MaritalStatus'].str.replace('marreid', 'married')
df['Gender'] = df['Gender'].replace(1, 'F').replace(0, 'M')

In [338]:
df['HourlyRate'] = df['HourlyRate'].replace('Not Available', np.nan)

## MIRNA

In [339]:
df['Over18'].value_counts()

Over18
Y    713
Name: count, dtype: int64

In [340]:
df['Over18'] = df['Over18'].replace('Y', True)

In [341]:
df['OverTime'] = df['OverTime'].replace({'Yes': True, 'No': False})

In [342]:
df["PercentSalaryHike"] = (df["PercentSalaryHike"]).astype(float) / 100

In [343]:
df['PerformanceRating'] = df['PerformanceRating'].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [344]:
df['StandardHours'] = df['StandardHours'].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [345]:
df['TOTALWORKINGYEARS'] = df["TOTALWORKINGYEARS"].str.replace(',', '.').astype(float).fillna(99999).astype(int)

## JOHANNA

In [346]:
df['Salary'] = df['Salary'].str.replace('$', '').astype(int)

In [347]:
df['RoleDepartament'] = df['RoleDepartament'].str.lower()

In [348]:
df.drop(['NUMBERCHILDREN'], axis = 1, inplace=True)

In [359]:
df['RemoteWork'] = df['RemoteWork'].replace(['Yes', 'yes' '1'], True).replace(['0', 'false'], False)

In [350]:
df['YearsInCurrentRole'] = df['YearsInCurrentRole'].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [351]:
df['SameAsMonthlyIncome'] = df['SameAsMonthlyIncome'].str.replace(',', '.').astype(float).fillna(99999).astype(int)

In [353]:
# cambiamos nulos === 99999
df['RoleDepartament'] == df['RoleDepartament'].fillna(99999)

# eliminamos el role job
lista_vacia = []

for dato in df['RoleDepartament']:
    dato = str(dato)
    if '-' in dato:
        dato = dato.split('- ')
        lista_vacia.append(dato[-1].strip())
    else:
        lista_vacia.append(dato)


# volcamos datos nuevos
df['RoleDepartament'] = lista_vacia

In [354]:
# cambiamos todos los 99999 a NaN
df.replace(99999, None, inplace=True)

In [355]:
pd.set_option('display.max_columns', None)
df.sample(15)

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,RemoteWork
1548,1548,43,True,frequently,NaN,NaN,10,4,life sciences,430,3,F,33,3,1,laboratory technician,4,NaN,2455,10675,0,True,False,0.19,3,1,None,0,None,5,"3,0",8,None,1,7,2455,1980,1000000000,nan,False
719,719,25,True,NaN,141.0,NaN,3,1,NaN,None,3,M,98,3,2,sales executive,1,NaN,4194,14363,1,NaN,True,0.18,3,4,None,0,5,3,"3,0",5,None,0,3,4194,1998,1000000000,nan,True
1236,1236,26,True,NaN,1357.0,NaN,25,3,life sciences,55,1,M,48,1,1,laboratory technician,3,single,None,10558,1,NaN,NaN,0.12,3,3,None,0,1,2,"2,0",1,None,0,1,None,1997,1000000000,nan,False
231,231,53,True,NaN,447.0,NaN,2,3,medical,1472,4,M,39,4,4,research director,2,single,16598,19764,4,NaN,False,0.12,3,2,None,0,35,2,"2,0",9,None,8,8,16598,1970,1000000000,nan,True
96,96,33,True,NaN,117.0,Research & Development,9,3,medical,1238,1,M,60,3,1,research scientist,4,married,None,6311,0,True,NaN,0.13,3,2,None,1,15,5,"3,0",14,None,4,10,None,1990,1000000000,research & development,False
703,703,26,True,rarely,703.0,NaN,28,2,marketing,641,1,M,66,3,2,sales executive,2,married,None,7428,1,True,NaN,0.20,4,4,None,2,None,5,"4,0",5,None,1,4,None,1997,1000000000,nan,True
117,117,45,True,frequently,1249.0,NaN,7,3,life sciences,None,1,M,97,3,3,laboratory technician,1,NaN,None,20308,1,True,NaN,0.18,3,1,None,1,24,2,"3,0",24,None,9,11,None,1978,1000000000,nan,Yes
171,171,40,True,NaN,692.0,NaN,11,3,technical degree,1985,4,F,73,3,2,laboratory technician,3,married,None,26849,1,NaN,NaN,0.11,None,1,None,1,10,2,"4,0",10,None,9,4,None,1983,1000000000,nan,True
1167,1167,36,True,frequently,884.0,NaN,23,2,medical,2061,3,M,41,4,2,laboratory technician,4,NaN,2571,12290,4,True,False,0.17,3,3,80,1,17,3,"3,0",5,None,0,3,2571,1987,1000000000,nan,False
1524,1524,57,True,rarely,593.0,NaN,1,4,medical,482,4,M,88,3,2,healthcare representative,3,NaN,6755,2967,2,NaN,False,0.11,3,3,None,0,None,2,"3,0",3,None,1,2,6755,1966,1000000000,nan,False
1175,1175,36,True,frequently,635.0,NaN,18,1,NaN,286,2,F,73,3,1,laboratory technician,4,single,None,7703,1,True,NaN,0.13,3,1,80,0,8,2,"3,0",8,None,1,7,None,1987,1000000000,nan,Yes
1118,1118,29,True,rarely,428.0,NaN,9,3,NaN,None,2,F,NaN,1,1,sales representative,2,single,2760,14630,1,NaN,NaN,0.13,3,3,80,0,2,3,"3,0",2,None,2,2,2760,1994,1000000000,nan,True
1312,1312,38,True,NaN,362.0,NaN,27,1,life sciences,662,3,F,NaN,3,1,research scientist,1,NaN,None,14561,3,NaN,False,0.17,3,4,None,0,8,3,"2,0",0,None,0,0,None,1985,1000000000,nan,True
450,450,46,True,NaN,717.0,Research & Development,13,4,NaN,1727,3,M,34,3,2,healthcare representative,2,single,None,9697,6,NaN,False,0.14,3,4,None,0,19,3,"3,0",10,None,0,9,None,1977,1000000000,research & development,True
960,960,25,True,NaN,583.0,NaN,4,1,NaN,885,3,M,87,2,2,sales executive,1,NaN,4256,18154,1,True,False,0.12,3,1,None,0,5,1,"4,0",5,None,0,3,4256,1998,1000000000,nan,False

In [356]:
df['EducationField'].dtype

dtype('O')

revisar:

- cambiar NaN (o nan) por None ------JOHANNA
- department: poner lower ------- MIRNA
- cambiar nombres columnas ------ INÉS
- hacer int: ------ ISA
    - WORKLIFEBALANCE: hacer int (**y revisar**)
    - DailyRate

In [14]:
df["Department"].value_counts

<bound method IndexOpsMixin.value_counts of 0                            NaN
1                            NaN
2        Research & Development
3                            NaN
4                            NaN
                  ...
1609                         NaN
1610                         NaN
1611                         NaN
1612                         NaN
1613                         NaN
Name: Department, Length: 1614, dtype: object>

In [15]:
df["Department"] = df["Department"].str.lower().replace("Research & Development", "research & development")

In [16]:
df["Department"].value_counts

<bound method IndexOpsMixin.value_counts of 0                            NaN
1                            NaN
2        research & development
3                            NaN
4                            NaN
                  ...
1609                         NaN
1610                         NaN
1611                         NaN
1612                         NaN
1613                         NaN
Name: Department, Length: 1614, dtype: object>

In [17]:
df["Department"].unique

<bound method Series.unique of 0                            NaN
1                            NaN
2        research & development
3                            NaN
4                            NaN
                  ...
1609                         NaN
1610                         NaN
1611                         NaN
1612                         NaN
1613                         NaN
Name: Department, Length: 1614, dtype: object>